backend: "python"
max_batch_size: 512

input [{
  name: "INPUT_TEXT"
  data_type: TYPE_STRING
  dims: -1
}]
  
output {
  name: "EMBEDDING_VECTOR"
  data_type: TYPE_STRING
  dims: -1
}

dynamic_batching { }

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
